app/controllers/users_controller.rb

    def create
       @user = User.new(user_params)
       if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "bonnieli@gmail.com"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2022-10-25 20:46:33.518316"], ["updated_at", "2022-10-25 20:46:33.518316"]]