app/models/user.rb

    def reset_session_token!
        self.session_token = self.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-10-25 20:46:33.591725"], ["id", 2]]